Module Module1

    Sub Main()
		Dim n As Integer = Nothing ' цена билета в рублях
		Dim x As Integer ' количество жетонов номиналом 4 рубля
		Dim y As Integer ' количество жетонов номиналом 7 рублей
		Dim found As Boolean = False ' флаг, нашли ли мы решение
		' Ввод цены билета
		Console.Write("Цена билета в рублях: ") ' Вывод подсказки
		Integer.TryParse(Console.ReadLine(), n) ' Ввод натурального числа
		y = n \ 7 ' начинаем с максимального количества жетонов по 7
		' Перебираем количество жетонов по 7 от максимума до 0,
		' пока не найдётся решение или не закончатся жетоны по 7
		Do While (y >= 0) AndAlso (Not found)
			Dim remainder As Integer = n - 7 * y ' Сумму разменяли на жетоны по 7
			If remainder Mod 4 = 0 Then ' Остаток разменяли на жетоны по 4
				x = remainder \ 4 ' Если удалось разменять всю сумму, конец цикла
				'  Вывод найденного решения на экран
				Console.WriteLine($"Введённую цену {n} можно разменять на жетоны:")
				Console.WriteLine($"Количество жетонов по 4 рубля: {x}")
				Console.WriteLine($"Количество жетонов по 7 рублей: {y}")
				' Флаговую переменную переменную установили в истинное значение,
				' так как нашли решение
				found = True
			End If
			y -= 1 ' уменьшаем количество жетонов по 7
		Loop
		' Решений для указанной суммы нет
		If Not found Then
			Console.WriteLine($"Введённую цену {n} рублей нельзя разменять на жетоны")
		End If
		Console.Read() ' Задержка вывода на экран до нажатия клавиши "Ввод"
	End Sub

End Module
